<head><title>Domain Driven Design</title><link rel="stylesheet" type="text/css" href="/Users/lumint/.atom/evnd/20160718/domain_driven_design_style.css"></head><div class="ever-notedown-preview"><div class="note-meta-info"><div class="note-meta-info-content"><p class="note-info"><span class="icon icon-book note-notebook">Business</span><span style="margin: 8px 8px;"></span><span class="icon icon-tag"></span><span class="badge note-tag">EVND</span><span style="margin: 2px 2px;"></span><span class="badge note-tag">code</span><span style="margin: 2px 2px;"></span><span class="badge note-tag">microservice</span><span style="margin: 2px 2px;"></span></p><p class="text-info note-title"><span class="icon icon-pencil">Domain Driven Design</span></p></div></div><div class="evnd-toc-div" title="evnd-toc-div"><ul class="table-of-contents toc-level-1" title="evnd-toc"></ul></div>
<ul>
<li><p>&#x9886;&#x57DF;&#x6A21;&#x578B;:</p>
<blockquote>
<p>&#x5F88;&#x591A;&#x56E0;&#x7D20;&#x4F1A;&#x4F7F;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x590D;&#x6742;&#x5316;&#xFF0C;&#x4F46;&#x6700;&#x6839;&#x672C;&#x7684;&#x539F;&#x56E0;&#x662F;&#x95EE;&#x9898;&#x9886;&#x57DF;&#x672C;&#x8EAB;&#x7684;&#x9519;&#x7EFC;&#x590D;&#x6742;&#xFF0C;&#x7136;&#x800C;&#x5F00;&#x53D1;&#x8F6F;&#x4EF6;&#x65E0;&#x6CD5;&#x56DE;&#x907F;&#x8FD9;&#x79CD;&#x8FD9;&#x79CD;&#x590D;&#x6742;&#x5EA6;&#xFF0C;&#x6240;&#x4EE5;&#x53EA;&#x80FD;&#x505A;&#x7684;&#x53EA;&#x7528;&#x63A7;&#x5236;&#x8FD9;&#x79CD;&#x590D;&#x6742;&#x5EA6;&#x3002;&#x63A7;&#x5236;&#x590D;&#x6742;&#x6027;&#x6700;&#x5173;&#x952E;&#x7684;&#x662F;&#x6709;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x3002;</p>
<p>&#x9886;&#x57DF;&#x5EFA;&#x6A21;&#x8FC7;&#x7A0B;&#x4E0D;&#x5E94;&#x5C06;&#x6982;&#x5FF5;&#x4E0E;&#x5B9E;&#x73B0;&#x5272;&#x88C2;&#x5F00;&#x3002;</p>
<p>&#x4E0D;&#x5E94;&#x8BE5;&#x5148;&#x8BBE;&#x8BA1;&#xFF0C;&#x5728;&#x6784;&#x5EFA;(&#x5148;&#x5EFA;&#x6A21;&#xFF0C;&#x540E;&#x5B9E;&#x73B0;)&#x5F3A;&#x5927;&#x7684;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x662F;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x6F14;&#x8FDB;&#x7684;</p>
<p>&#x5B98;&#x50DA;&#x4E3B;&#x4E49;&#x3001;&#x76EE;&#x6807;&#x4E0D;&#x6E05;&#x3001;&#x8D44;&#x6E90;&#x7F3A;&#x4E4F;&#x7B49;&#x90FD;&#x4F1A;&#x5BFC;&#x81F4;&#x9879;&#x76EE;&#x504F;&#x79BB;&#x8F68;&#x9053;&#xFF0C;&#x4F46;&#x662F;&#x771F;&#x6B63;&#x51B3;&#x5B9A;&#x8F6F;&#x4EF6;&#x590D;&#x6742;&#x5EA6;&#x7684;&#x662F;&#x8BBE;&#x8BA1;&#x65B9;&#x6CD5;&#xFF0C;&#x4E00;&#x4E9B;&#x8BBE;&#x8BA1;&#x56E0;&#x7D20;&#x662F;&#x6280;&#x672F;&#x4E0A;&#x7684;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x8F6F;&#x4EF6;&#x6700;&#x4E3B;&#x8981;&#x7684;&#x590D;&#x6742;&#x5EA6;&#x4E0D;&#x5728;&#x6280;&#x672F;&#x4E0A;&#xFF0C;&#x800C;&#x662F;&#x5728;&#x9886;&#x57DF;&#x672C;&#x8EAB;&#x3001;&#x7528;&#x6237;&#x7684;&#x6D3B;&#x52A8;&#x6216;&#x4E1A;&#x52A1;&#x3002;</p>
<p>&#x9886;&#x57DF;&#x9A71;&#x52A8;&#x8BBE;&#x8BA1;&#x7684;&#x5B9E;&#x8D28;&#x5C31;&#x662F;&#x6D88;&#x5316;&#x5438;&#x6536;&#x5927;&#x91CF;&#x77E5;&#x8BC6;&#xFF0C;&#x6700;&#x540E;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x53CD;&#x6620;&#x6DF1;&#x5C42;&#x6B21;&#x9886;&#x57DF;&#x77E5;&#x8BC6;&#x5E76;&#x805A;&#x7126;&#x4E8E;&#x5173;&#x952E;&#x6982;&#x5FF5;&#x7684;&#x6A21;&#x578B;&#x3002;&#x8FD9;&#x662F;&#x9886;&#x57DF;&#x4E13;&#x5BB6;&#x548C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x534F;&#x4F5C;&#x8FC7;&#x7A0B;&#xFF0C;&#x7ECF;&#x8FC7;&#x5F00;&#x53D1;&#x8FED;&#x4EE3;&#x628A;&#x8FD9;&#x79CD;&#x534F;&#x4F5C;&#x8D2F;&#x7A7F;&#x5230;&#x6574;&#x4E2A;&#x9879;&#x76EE;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x3002;</p>
<p>&#x6A21;&#x578B;&#x662F;&#x4E00;&#x79CD;&#x7B80;&#x5316;&#xFF0C;&#x5BF9;&#x73B0;&#x5B9E;&#x7684;&#x89E3;&#x91CA;&#xFF0C;&#x628A;&#x4E0E;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x5BC6;&#x5207;&#x76F8;&#x5173;&#x7684;&#x65B9;&#x9762;&#x62BD;&#x8C61;&#x51FA;&#x6765;&#x800C;&#x5FFD;&#x7565;&#x65E0;&#x5173;&#x7684;&#x7EC6;&#x8282;&#x3002;</p>
<p>&#x6267;&#x884C;&#x7528;&#x6237;&#x7684;&#x6A21;&#x578B;&#x6D3B;&#x52A8;&#x6216;&#x6EE1;&#x8DB3;&#x7528;&#x6237;&#x7684;&#x67D0;&#x79CD;&#x9700;&#x6C42;&#xFF0C;&#x7528;&#x6237;&#x7684;&#x95EE;&#x9898;&#x533A;&#x57DF;&#x5C31;&#x662F;&#x8F6F;&#x4EF6;&#x7684;&#x9886;&#x57DF;&#xFF0C;&#x8F6F;&#x4EF6;&#x9886;&#x57DF;&#x4E00;&#x822C;&#x4E0E;&#x8BA1;&#x7B97;&#x673A;&#x5173;&#x7CFB;&#x4E0D;&#x5927;&#x3002;</p>
<p>&#x6A21;&#x578B;&#x662F;&#x89E3;&#x51B3;&#x4FE1;&#x606F;&#x8D85;&#x8F7D;&#x95EE;&#x9898;&#x7684;&#x5DE5;&#x5177;&#x3001;&#x6A21;&#x578B;&#x8FD9;&#x79CD;&#x77E5;&#x8BC6;&#x5F62;&#x5F0F;&#x5BF9;&#x77E5;&#x8BC6;&#x8FDB;&#x884C;&#x4E86;&#x9009;&#x62E9;&#x6027;&#x7684;&#x7B80;&#x5316;&#x548C;&#x6709;&#x610F;&#x7684;&#x7ED3;&#x6784;&#x5316;&#xFF0C;&#x9002;&#x5F53;&#x7684;&#x6A21;&#x578B;&#x53EF;&#x4EE5;&#x4F7F;&#x4EBA;&#x7406;&#x89E3;&#x4FE1;&#x606F;&#x7684;&#x610F;&#x4E49;&#xFF0C;&#x5E76;&#x4E13;&#x6CE8;&#x4E8E;&#x95EE;&#x9898;&#x3002;&#x662F;&#x4E00;&#x79CD;&#x9009;&#x62E9;&#x6027;&#x7684;&#x62BD;&#x8C61;&#x3002;</p>
<p>&#x4E1A;&#x52A1;&#x6D3B;&#x52A8;&#x548C;&#x89C4;&#x5219;&#x5982;&#x540C;&#x6D89;&#x53CA;&#x7684;&#x5B9E;&#x4F53;&#x4E00;&#x6837;&#xFF0C;&#x90FD;&#x662F;&#x9886;&#x57DF;&#x7684;&#x6838;&#x5FC3;&#x3002;</p>
<p>&#x5982;&#x679C;&#x6CA1;&#x6709;&#x7EDF;&#x4E00;&#x7684;&#x516C;&#x5171;&#x8BED;&#x8A00;&#xFF0C;&#x5219;&#x4F1A;&#x5BFC;&#x81F4;&#x5F00;&#x53D1;-&gt;&#x5F00;&#x53D1; &#x5F00;&#x53D1;-&gt;&#x9886;&#x57DF;&#x4E13;&#x5BB6; &#x4E0D;&#x540C;&#x56E2;&#x961F;&#x95F4;&#x4E0D;&#x80FD;&#x6D51;&#x7136;&#x4E00;&#x4F53;&#xFF0C;&#x6A21;&#x578B;&#x7684;&#x77E5;&#x8BC6;&#x548C;&#x60F3;&#x6CD5;&#x65E0;&#x6CD5;&#x7ED3;&#x5408;&#x5230;&#x4E00;&#x8D77;&#x3002;</p>
<p>&#x5982;&#x679C;&#x8BED;&#x8A00;&#x652F;&#x79BB;&#x7834;&#x788E;&#xFF0C;&#x9879;&#x76EE;&#x5FC5;&#x5C06;&#x9047;&#x5230;&#x4E25;&#x91CD;&#x95EE;&#x9898;&#xFF0C;&#x4E00;&#x4E2A;&#x6982;&#x5FF5;&#x88AB;&#x7FFB;&#x8BD1;&#x6765;&#x7FFB;&#x8BD1;&#x53BB;&#xFF0C;&#x5F31;&#x5316;&#x4E86;&#x77E5;&#x8BC6;&#x7684;&#x6D88;&#x5316;&#xFF0C;&#x5BF9;&#x9886;&#x57DF;&#x4E0D;&#x80FD;&#x6DF1;&#x523B;&#x7406;&#x89E3;&#xFF0C;&#x65E0;&#x6CD5;&#x8BB0;&#x5F55;&#x5230;&#x6587;&#x6863;&#x6216;&#x4EE3;&#x7801;&#x3002;&#x7FFB;&#x8BD1;&#x548C;&#x8BEF;&#x89E3;&#x7684;&#x5F00;&#x9500;&#x6210;&#x672C;&#x5F88;&#x9AD8;&#x3002;</p>
<p>&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5E94;&#x8BE5;&#x57FA;&#x4E8E;&#x6A21;&#x578B;&#x7684;&#x8BED;&#x8A00;&#x6765;&#x63CF;&#x8FF0;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x5DE5;&#x4EF6;&#xFF0C;&#x4EFB;&#x52A1;&#x548C;&#x529F;&#x80FD;&#x3002;&#x5E76;&#x4E14;&#x9886;&#x57DF;&#x4E13;&#x5BB6;&#x57FA;&#x4E8E;&#x8FD9;&#x4E2A;&#x76F8;&#x4E92;&#x4EA4;&#x6D41;&#xFF0C;&#x8BA8;&#x8BBA;&#x9700;&#x6C42;&#x3001;&#x5F00;&#x53D1;&#x8BA1;&#x5212;&#x548C;&#x7279;&#x6027;&#x3002;</p>
<p>&#x5BF9;&#x9886;&#x57DF;&#x7684;&#x62BD;&#x8C61;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x600E;&#x4E48;&#x5224;&#x65AD;&#x62BD;&#x8C61;&#x7684;&#x662F;&#x5426;&#x5408;&#x7406;&#xFF0C;&#x662F;&#x5426;&#x50CF;&#x9886;&#x57DF;&#x4E13;&#x5BB6;&#x6837;&#x6DF1;&#x5165;&#x7406;&#x89E3;&#x9886;&#x57DF;&#x3002;</p>
<p>&#x7EC6;&#x8282;&#x8FC7;&#x591A;&#x7684;&#x7ED3;&#x679C;&#x662F;&#x201C;&#x53EA;&#x89C1;&#x6811;&#x6728;&#xFF0C;&#x4E0D;&#x89C1;&#x68EE;&#x6797;&#x201D;&#x3002;</p>
<p>&#x8BBE;&#x8BA1;&#x4E2D;&#x7684;&#x91CD;&#x8981;&#x7EC6;&#x8282;&#x5E94;&#x8BE5;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x63D0;&#x73B0;&#x51FA;&#x6765;&#xFF0C;&#x826F;&#x597D;&#x7684;&#x5B9E;&#x73B0;&#x5E94;&#x8BE5;&#x662F;&#x900F;&#x660E;&#x7684;&#x3002;</p>
<p>&#x9879;&#x76EE;&#x6587;&#x6863;&#x5E94;&#x8BE5;&#x662F;&#x5BF9;&#x4EE3;&#x7801;&#x7684;&#x4E00;&#x79CD;&#x8865;&#x5145;&#xFF0C;&#x5FC5;&#x987B;&#x6DF1;&#x5165;&#x5230;&#x5404;&#x79CD;&#x9879;&#x76EE;&#x6D3B;&#x52A8;&#x4E2D;&#xFF0C;&#x628A;&#x6587;&#x6863;&#x51CF;&#x5C11;&#x81F3;&#x6700;&#x5C11;&#x3002;</p>
<p>&#x597D;&#x7684;&#x7F16;&#x7A0B;&#x98CE;&#x683C;&#x5C3D;&#x529B;&#x662F;&#x53D8;&#x91CF;&#x3001;&#x4EE3;&#x7801;&#x7EC4;&#x7EC7;&#x65B9;&#x5F0F;&#x3001;&#x65B9;&#x6CD5;&#x540D;&#x5E94;&#x53EF;&#x80FD;&#x7684;&#x4E25;&#x683C;&#xFF0C;&#x4F7F;&#x8FD9;&#x79CD;&#x8054;&#x7CFB;&#x76F4;&#x63A5;&#x5316;&#x3002;</p>
</blockquote>
<p>&gt;</p>
<p>&gt;</p>
<p>&gt;</p>
<p>&gt;</p>
<p>&gt;</p>
<p>&gt;</p>
<p>&gt;</p>
</li>
<li><a href="&#x654F;&#x6377;&#x5F00;&#x53D1;&amp;XP">Surviving Object-Oriented Projects</a></li>
</ul><div style="display:none" title="evnd-note-id" id="evnd-note-id"><p>[Note ID: cc4e2b7fb5cb9df44cb8faae688a287d]</p></div></div>